Reports/ЗаказанныйМатериал.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ЗаказанныйМатериал</Name>
		</Properties>
	</Report>
</MetaDataObject>

AccumulationRegisters/ЗаказПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказПоставщику</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Reports/ЗаказанныйМатериал/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура Обновить(Команда)
	СформироватьОтчет();
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчет()
	тзДанныеДляВывода = ПолучитьДанныеДляВывода();
	ВывестиДанные(тзДанныеДляВывода);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СформироватьОтчет();
КонецПроцедуры

&НаСервере
Процедура ВывестиДанные(тзДанныеДляВывода)
 	Макет = Отчеты.ЗаказанныйМатериал.ПолучитьМакет("Макет");
	
	ПолеВывода.Очистить();
	
	ПолеВывода.Вывести(Макет.ПолучитьОбласть("Шапка"));
	
	обСтрока = Макет.ПолучитьОбласть("Строка");
	
	Для каждого х Из тзДанныеДляВывода Цикл
		обСтрока.Параметры.Заполнить(х);
		ПолеВывода.Вывести(обСтрока);
	КонецЦикла;
	

КонецПроцедуры // ВывестиДанные(тзДанныеДляВывода)


&НаСервере
Функция ПолучитьДанныеДляВывода()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПоставщикуОстатки.Поставщик КАК Поставщик,
		|	ЗаказПоставщикуОстатки.Номенклатура КАК Номенклатура,
		|	ЗаказПоставщикуОстатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.ЗаказПоставщику.Остатки(&Дата, ) КАК ЗаказПоставщикуОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказПоставщикуОстатки.Поставщик.Наименование,
		|	ЗаказПоставщикуОстатки.Номенклатура.Наименование";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьДанныеДляВывода()
